aizatsyafiq/STM32WLE5CCU-with-LoRa/1-Nucleo (as reference)/2 - SM FSM/SM FSM.c
#if HAB_CODE == 1 | SM_CODE == 1
	HAL_UART_Transmit(&huart2, (uint8_t *)"RX Received a packet\r\n", 22, HAL_MAX_DELAY);
	uint8_t payloadLength = 0;
	uint8_t rxStartBufferPointer = 0;
	//get payload
	SUBGRF_GetRxBufferStatus(&payloadLength, &rxStartBufferPointer);
	//read payload
	SUBGRF_ReadBuffer(rxStartBufferPointer, (uint8_t *)fsm->rxBuffer, payloadLength);
	//display payload
	HAL_UART_Transmit(&huart2, (uint8_t *)"Received: ", 10, HAL_MAX_DELAY);
	HAL_UART_Transmit(&huart2, (uint8_t *)fsm->rxBuffer, 9, HAL_MAX_DELAY);
	HAL_UART_Transmit(&huart2, (uint8_t *)"\r\n", 2, HAL_MAX_DELAY);
#endif

#if HAB_CODE == 1
	char* p = fsm->rxBuffer;
	if(HABSentAckToGS == false){
		if(strncmp(p, "A", 1) == 0){
			HABReceivedGSCommand = true;
			HABSentAckToGS = true;
		}
	}else{
		if(strncmp(p, "001", 3) == 0){
			strncpy(receivedPacket[smPacketCounter].hexPacket, p, 10);
			receivedPacket[smPacketCounter].hexPacket[10] = '\0';
			smPacketCounter++;
			endRxMode = true;
			gotSMPacketToTransmit = true;
			//turn off rx
		}
	}
#endif

#if SM_CODE == 1
	char* p = fsm->rxBuffer;
	if(strncmp(p, "0401", 4) == 0){
		readyToTx = true;
		//turn off rx
	}
#endif

#if TRANSMIT_ONLY == 0
		HAL_UART_Transmit(&huart2, (uint8_t *)"Event RX Done\r\n", 15, HAL_MAX_DELAY);
#if RECEIVING_ONLY == 1
		// Get the received packet
		uint8_t payloadLength = 0;
		uint8_t rxStartBufferPointer = 0;
		SUBGRF_GetRxBufferStatus(&payloadLength, &rxStartBufferPointer);

		// Read the packet
		SUBGRF_ReadBuffer(rxStartBufferPointer, (uint8_t *)fsm->rxBuffer, payloadLength);

		// Display the received message
		HAL_UART_Transmit(&huart2, (uint8_t *)"Received: ", 10, HAL_MAX_DELAY);
		//	HAL_UART_Transmit(&huart2, fsm->rxBuffer, payloadLength, HAL_MAX_DELAY);
		HAL_UART_Transmit(&huart2, (uint8_t *)fsm->rxBuffer, PAYLOADLENGTH, HAL_MAX_DELAY);
		HAL_UART_Transmit(&huart2, (uint8_t *)"\r\n", 2, HAL_MAX_DELAY);

		PacketStatus_t packetStatus;
		char uartBuff[50];
		SUBGRF_GetPacketStatus(&packetStatus);
		sprintf(uartBuff, "RssiValue=%d dBm, SnrValue=%d Hz\r\n", packetStatus.Params.LoRa.RssiPkt, packetStatus.Params.LoRa.SnrPkt);
		HAL_UART_Transmit(&huart2, (uint8_t *)uartBuff, strlen(uartBuff), HAL_MAX_DELAY);

		enterMasterRx(fsm);

		//  transitionRxDone(fsm);
		//  HAL_UART_Transmit(&huart2, (uint8_t*)fsm->rxBuffer, fsm->rxSize, HAL_MAX_DELAY);
		//  enterMasterRx(fsm);
#else
	switch(fsm->state)
	{
	case STATE_MASTER:
		switch (fsm->subState)
		{
		case SSTATE_RX:
			transitionRxDone(fsm);
			if (strncmp(fsm->rxBuffer, "PONG", 4) == 0)
			{
				BSP_LED_Off(LED_GREEN);
				BSP_LED_Toggle(LED_RED);
				enterMasterTx(fsm);
				fsm->subState = SSTATE_TX;
			}
			else if (strncmp(fsm->rxBuffer, "PING", 4) == 0)
			{
				enterSlaveRx(fsm);
				fsm->state = STATE_SLAVE;
			}
			else
			{
				enterMasterRx(fsm);
			}
			break;
		default:
			break;
		}
		break;
		case STATE_SLAVE:
			switch (fsm->subState)
			{
			case SSTATE_RX:
				transitionRxDone(fsm);
				if (strncmp(fsm->rxBuffer, "PING", 4) == 0)
				{
					BSP_LED_Off(LED_RED);
					BSP_LED_Toggle(LED_GREEN);
					enterSlaveTx(fsm);
					fsm->subState = SSTATE_TX;
				}
				else
				{
					enterMasterRx(fsm);
					fsm->state = STATE_MASTER;
				}
				break;
			default:
				break;
			}
			break;
			default:
				break;
	}
#endif
#endif //TRANSMIT_ONLY == 0
}


/**
 * @brief  Process the TX Timeout event
 * @param  fsm pointer to FSM context
 * @retval None
 */
void eventTxTimeout(pingPongFSM_t *const fsm)
{
#if TRANSMIT_ONLY == 1
	HAL_UART_Transmit(&huart2, (uint8_t *)"Event TX Timeout\r\n", 18, HAL_MAX_DELAY);
	switch (fsm->state)
	{
	case STATE_MASTER:
		switch (fsm->subState)
		{
		case SSTATE_TX:
			//			enterMasterRx(fsm);
			fsm->subState = SSTATE_RX;
			break;
		default:
			break;
		}
		break;
		case STATE_SLAVE:
			switch (fsm->subState)
			{
			case SSTATE_TX:
				enterSlaveRx(fsm);
				fsm->subState = SSTATE_RX;
				break;
			default:
				break;
			}
			break;
			default:
				break;
	}
#endif
}


/**
 * @brief  Process the RX Timeout event
 * @param  fsm pointer to FSM context
 * @retval None
 */
void eventRxTimeout(pingPongFSM_t *const fsm)
{
#if HAB_CODE == 1
	endRxMode = true;
	HAL_UART_Transmit(&huart2, (uint8_t *)"Event RX Timeout\r\n", 18, HAL_MAX_DELAY);
#endif

#if GS_CODE == 1
	gsSavePacket = false;
	gsPacketCounter = 0;
	HAL_UART_Transmit(&huart2, (uint8_t *)"Event RX Timeout\r\n", 18, HAL_MAX_DELAY); //delete this
#endif

#if RECEIVING_ONLY == 1
	//HAL_UART_Transmit(&huart2, (uint8_t *)"Event RX Timeout\r\n", 18, HAL_MAX_DELAY);
	//	switch (fsm->state)
	//	{
	//	case STATE_MASTER:
	//		switch (fsm->subState)
	//		{
	//		case SSTATE_RX:
	//			HAL_Delay(fsm->randomDelay);
	//			enterMasterTx(fsm);
	//			fsm->subState = SSTATE_TX;
	//			break;
	//		default:
	//			break;
	//		}
	//		break;
	//		case STATE_SLAVE:
	//			switch (fsm->subState)
	//			{
	//			case SSTATE_RX:
	//				enterSlaveRx(fsm);
	//				break;
	//			default:
	//				break;
	//			}
	//			break;
	//			default:
	//				break;
	//	}
#endif
}


/**
 * @brief  Process the RX Error event
 * @param  fsm pointer to FSM context
 * @retval None
 */
void eventRxError(pingPongFSM_t *const fsm)
{
#if RECEIVING_ONLY == 1
	HAL_UART_Transmit(&huart2, (uint8_t *)"Event Rx Error\r\n", 16, HAL_MAX_DELAY);
	HAL_UART_Transmit(&huart2, (uint8_t *)fsm->rxBuffer, 6, HAL_MAX_DELAY);
	switch (fsm->state)
	{
	case STATE_MASTER:
		switch (fsm->subState)
		{
		case SSTATE_RX:
			HAL_Delay(fsm->randomDelay);
			enterMasterTx(fsm);
			fsm->subState = SSTATE_TX;
			break;
		default:
			break;
		}
		break;
		case STATE_SLAVE:
			switch (fsm->subState)
			{
			case SSTATE_RX:
				enterSlaveRx(fsm);
				break;
			default:
				break;
			}
			break;
			default:
				break;
	}
#endif
}


/**
 * @brief  Entry actions for the RX sub-state of the Master state
 * @param  fsm pointer to FSM context
 * @retval None
 */
void enterMasterRx(pingPongFSM_t *const fsm)
{
#if RECEIVING_ONLY == 1
	HAL_UART_Transmit(&huart2, (uint8_t *)"Master Rx start\r\n", 17, HAL_MAX_DELAY);
	SUBGRF_SetDioIrqParams( IRQ_RX_DONE | IRQ_RX_TX_TIMEOUT | IRQ_CRC_ERROR | IRQ_HEADER_ERROR,
			IRQ_RX_DONE | IRQ_RX_TX_TIMEOUT | IRQ_CRC_ERROR | IRQ_HEADER_ERROR,
			IRQ_RADIO_NONE,
			IRQ_RADIO_NONE );
	SUBGRF_SetSwitch(RFO_LP, RFSWITCH_RX);

